/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_next_line_utils.c                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: min-cho <min-cho@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/28 19:45:25 by min-cho           #+#    #+#             */
/*   Updated: 2022/03/28 19:45:25 by min-cho          ###   ########seoul.kr  */
/*                                                                            */
/* ************************************************************************** */

#include "get_next_line.h"

size_t	read(int fd, void *buf, size_t nbytes)
//(읽을 파일의 디스크립터, 읽어들인 데이터를 저장할 버퍼(배열), 
// 읽어들일 데이터의 최대 길이(버퍼미만))
// 반환값 -> 읽어들인 데이터의 길이

//파일을 읽어서 개행문자를 만나면 해당line을 반환
//개행문자 이후내용은 버퍼에 저장